# WaterLoopData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WaterLoopData Class
Members See Also
---
Represents the data and parameters of analytical water loop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class WaterLoopData : IDisposable
```

Visual Basic
---
```text
Public Class WaterLoopData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WaterLoopData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..WaterLoopData
# See Also
WaterLoopData Members
Autodesk.Revit.DB.Mechanical Namespace